In [5]:
import numpy as np
import pandas as pd

### Analysis

### Concat and append

In [6]:
x = [1, 2, 3]
y = [4, 5, 6]
z = [7, 8, 9]

In [7]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1,2,3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4,5,6])
pd.concat([ser1,ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

### Aggregations

In [12]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.rand(5))
ser

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

In [13]:
ser.sum()

2.811925491708157

In [14]:
ser.mean()

0.5623850983416314

In [15]:
df = pd.DataFrame({'A': rng.rand(5),
                    'B': rng.rand(5)})
df

          A         B
0  0.155995  0.020584
1  0.058084  0.969910
2  0.866176  0.832443
3  0.601115  0.212339
4  0.708073  0.181825

In [16]:
df.mean()

A    0.477888
B    0.443420
dtype: float64

In [17]:
df.mean(axis='columns')

0    0.088290
1    0.513997
2    0.849309
3    0.406727
4    0.444949
dtype: float64

In [18]:
import seaborn as sns
planets = sns.load_dataset('planets')
planets.shape

(1035, 6)

In [19]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [20]:
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

### Groupby

In [21]:
df = pd.DataFrame({'key': ['A','B','C','A','B','C'],
                    'data': range(6)}, columns=['key','data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [22]:
df.groupby('key').max()

     data
key
A       3
B       4
C       5

In [23]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [24]:
planets.orbital_period.median()

39.9795

In [25]:
planets.groupby('year')['orbital_period'].median()

year
1989     83.888000
1992     45.901950
1994     98.211400
1995      4.230785
1996     65.669700
1997     39.845000
1998     58.112890
1999    256.780000
2000    179.665000
2001    462.790000
2002    505.549000
2003    441.470000
2004     35.103500
2005     68.630000
2006    233.150000
2007    311.665000
2008    226.930000
2009    464.700000
2010     16.278350
2011     20.219180
2012     11.738714
2013     24.806000
2014     12.815900
Name: orbital_period, dtype: float64

In [26]:
planets.dropna().groupby('method')['distance'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Radial Velocity,497.0,51.814829,46.29828,1.35,24.15,39.56,59.28,354.0
Transit,1.0,178.000000,NaN,178.00,178.00,178.00,178.00,178.0

### Pivot Tables

In [28]:
titanic = sns.load_dataset('titanic')

In [29]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [30]:
titanic.groupby('sex')[['survived']].mean()

        survived
sex
female  0.742038
male    0.188908

In [31]:
titanic.groupby(['sex','class'])['survived'].aggregate('mean')

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

In [32]:
titanic.groupby(['sex','class'])['survived'].aggregate('mean').unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [34]:
titanic.pivot_table('survived', index='sex', columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [35]:
titanic.pivot_table('age', ['sex','survived'], 'class')

class                First     Second      Third
sex    survived
female 0         25.666667  36.000000  23.818182
       1         34.939024  28.080882  19.329787
male   0         44.581967  33.369048  27.255814
       1         36.248000  16.022000  22.274211

In [37]:
age = pd.cut(titanic['age'], [0,18,80])
titanic.pivot_table('survived',['sex',age],'class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 80]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 80]  0.375000  0.071429  0.133663

In [38]:
titanic.pivot_table(index='sex', columns='class',
                    aggfunc={'survived':sum, 'fare':'mean'})

              fare                       survived
class        First     Second      Third    First Second Third
sex
female  106.125798  21.970121  16.118810       91     70    72
male     67.226127  19.741782  12.661633       45     17    47